{
  "ppc": [
    {
      "id": 1,
      "chave_especial": [
        "Bacharelado",
        "Engenharia",
        "Curso",
        "Introdução"
      ],
      "chave_primaria": "Apresentação",
      "texto": "O curso de Bacharelado em Engenharia de Software (BES) é oferecido pelo Instituto de Informática (INF) da Universidade Federal de Goiás (UFG). A primeira versão do Projeto Pedagógico do Curso (PPC) foi criada em 2008, a segunda versão, registrada nesse documento, é fruto de uma reflexão de dois anos do Núcleo Docente Estruturante (NDE), que reinventou o BES. A busca pela qualidade é a motivação (p. 13) dessa segunda versão, que só pode ser adequadamente compreendida com o detalhamento da história da criação do curso e do cenário no qual está inserido (p. 10), o que lembra Paulo Freire, segundo o qual 'toda leitura de texto pressupõe uma rigorosa leitura do contexto'. Não houve alteração relevante dos objetivos do curso (p. 14), nem tampouco do perfil do egresso (p. 15), contudo, ambos foram refinados. Os requisitos legais e normativos foram ampliados pelas diretrizes curriculares nacionais (que não existiam quando a primeira versão foi produzida). Em particular, a estratégia para atender a educação das relações étnico-raciais e para o ensino de história e cultura afro-brasileira e africana foi revista em sua totalidade. A estrutura curricular (p. 35) sofreu mudanças significativas. Em particular, o fluxo sugerido, nos quatro primeiros períodos, inclui apenas disciplinas de formação básica em computação. A disciplina 'Prática em Engenharia de Software' (p. 75) é o elemento integrador do curso, com carga horária de 320 horas. Em particular, as disciplinas específicas de Engenharia de Software são acompanhadas de uma seção adicional, “condições mínimas” (p. 56), que estabelece competências a serem demonstradas/ adquiridas pelo estudante em cada uma delas. A busca por um curso de Engenharia de Software melhor é uma atribuição contínua do NDE estabelecida nesse PPC por meio de princípios (p. 23). Esse compromisso é oportuno para estabelecer claramente a responsabilidade pela gestão do presente PPC pelo NDE, sem o qual esse texto resume-se a um registro de intenções.",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 2,
      "chave_especial": [
        "Detalhes",
        "Informações"
      ],
      "chave_primaria": "Identificação",
      "texto": "",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Nome do curso",
          "texto": {
            "primeira_parte": "Engenharia de Software"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Grau acadêmico",
          "texto": {
            "primeira_parte": "Bacharelado"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 3,
          "nome": "Título do egresso",
          "texto": {
            "primeira_parte": "Bacharel(a) em Engenharia de Software"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 4,
          "nome": "Área de conhecimento (CNPq)",
          "texto": {
            "primeira_parte": "Ciências Exatas e da Terra (1.00.00.00-3) Ciência da Computação (l.O3.00.00-7) Metodologia e Técnicas da Computação (1.03.03.00-6) Engenharia de Software (l.O3.03.02-2)"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 5,
          "nome": "Modalidade",
          "texto": {
            "primeira_parte": "Presencial"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 6,
          "nome": "Local de oferta",
          "texto": {
            "primeira_parte": "Instituto de Informática (UFG) Alameda Palmeiras, Quadra D, Câmpus Samambaia Goiânia (GO), CEP 74690-900"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 7,
          "nome": "Reconhecimento",
          "texto": {
            "primeira_parte": "Portaria N” 819 de 29 de outubro de 2015. Número de registro no e-MEC: 201307356."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 8,
          "nome": "Responsável",
          "texto": {
            "primeira_parte": "Instituto de Informática (INF)"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 9,
          "nome": "Unidades executoras",
          "texto": {
            "primeira_parte": "Instituto de Informática (INF) Instituto de Matemática e Estatística (IME) Faculdade de Letras (Letras)"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 10,
          "nome": "Número de vagas",
          "texto": {
            "primeira_parte": "40 vagas anuais"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 11,
          "nome": "Carga horária",
          "texto": {
            "primeira_parte": "3200"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 12,
          "nome": "Duração do curso em semestres",
          "texto": {
            "primeira_parte": "9 semestres"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 13,
          "nome": "Turno de funcionamento",
          "texto": {
            "primeira_parte": "Noturno"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 14,
          "nome": "Forma de ingresso",
          "texto": {
            "primeira_parte": "Sistema de Seleção Unificada (SiSU). Em caso de existência de vagas é possível o ingresso através: (a) de transferência de outras instituições de ensino superior; (b) portadores de diploma ou (c) reingresso. Essas opções dependem de processo seletivo CSPCCÍñCO na UFG."
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 3,
      "chave_especial": [
        "Instituto de Informática",
        "Estrutura"
      ],
      "chave_primaria": "Contexto",
      "texto": "O Bacharelado em Engenharia de Software (BES) existe e se mantém em um contexto no qual se destaca a aptidão do Instituto de Informática, a carência de mão de obra apta a desenvolver softwares de qualidade e a importância local do curso, detalhados nas seções seguintes.",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Da aptidão do Instituto de Informática",
          "texto": {
            "primeira_parte" : "O Instituto de Informática da UFG possui sólida experiência no ensino superior em Computação, iniciada em 1983, com a primeira turma do curso de Bacharelado em Ciências da Computação (CC). A partir de 2009 foram criados mais dois Cursos de graduação: o Bacharelado em Engenharia de Software (BES) e o Bacharelado em Sistemas de Informação (SI). O INF também é responsável por dezenas de disciplinas da área de Computação ministradas para diversos cursos de graduação de várias unidades de ensino da UFG. Na pós-graduação lato sensu o INF já ofertou dezenas de edições dos mais variados cursos de especialização na área de Computação. Na pós-graduação stricto Sema o INF oferece, desde 2001, o Mestrado em Ciência da Computação. A partir de 2010 o INF passou a oferecer o Doutorado em Ciência da Computação. Essa história perfaz mais de três décadas de ensino, com milhares de egressos, alguns deles ocupando cargos de destaque em universidades, empresas e organizações tanto no Brasil quanto no exterior. O INF construiu, ao longo desse período, um consistente envolvimento com empresas e organizações de Tecnologia da Informação e Comunicação (TIC). O Apoema [APOEMA] é o órgão do INF responsável pela cooperação e interação com organizações externas, com foco em soluções inovadoras. Um número significativo de projetos de Pesquisa e Desenvolvimento (P&D) já foi realizado pelo INF em parceria com organizações locais, e alguns com empresas multinacionais (como Dell e HP, por exemplo). O INF também já participou de vários projetos de inovação tecnológica financiados pela Fundação de Apoio à Pesquisa do Estado de Goiás (FAPEG)."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Da carência de mão de obra",
          "texto": {
            "primeira_parte":"Um dos motivos para a existência do BES é a necessidade de formar recursos humanos em Engenharia de Software. A demanda por profissionais especializados na produção de software não existe só no Estado de Goiás, nem tampouco apenas no Brasil, mas em todo o mundo. Apesar da demanda, na ocasião da criação do BES, não era conhecido outro curso com a mesma denominação ou propósito no Brasil. A tradição do INF na socialização da Computação, juntamente com a atuação em Engenharia de Software do seu corpo docente, resultou em proposta pioneira no País de um curso especificamente voltado para a formação de Engenheiros de Software, com ênfase na produção de software. Hoje, o Guia dos Estudantes da Editora Abril lista 28 cursos similares. A região da Grande Goiânia reúne centenas de empresas de TIC, mas elas participam de forma tímida no mercado de software nacional. Com a disponibilidade de recursos humanos qualificados, essa participação pode crescer, o que é compatível com a dimensão do Estado de Goiás, a oitava economia nacional. Portanto, promover a indústria de produção de software em Goiás significa fomentar o aumento da participação das empresas do estado no mercado de software."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 3,
          "nome": "Dos indicadores socioeconômicos regionais",
          "texto": {
            "primeira_parte": "O BES cria a possibilidade de acesso ao ensino superior para aqueles que não podem usufruir do ensino privado. Segundo o IBGE [IBGE], em Goiás, 62.133 estudantes de graduação frequentavam cursos públicos em 2010, enquanto 156.415 estavam matriculados em cursos privados. Ou seja, estudantes em cursos públicos representam menos de 30% do total de estudantes matriculados no ensino superior. O rendimento nominal médio mensal domiciliar per capita de todos os municípios brasileiros revela que, das cidades goianas, a capital do estado é a melhor posicionada, em vigésimo quarto lugar. O município goiano seguinte nesta classificação é Alto Paraíso de Goiás, na posição 158. O terceiro éjataí, na posição 188. Até esta terceira aparição de municípios goianos, observa-se que           o Estado do Rio Grande do Sul contribui com 57 municípios, São Paulo contribui com 55 municípios e Santa Catarina com 25 municípios. Quando se analisa o produto interno bruto (PIB) dos municípios brasileiros, dentre os cem maiores, Goiás contribui com apenas 2 municípios (Goiânia e Anápolis). Reunidos, estes dois municípios possuem PIB inferior ao do décimo terceiro colocado, São Bernardo do Campo (SP).  Os Valores expostos acima sugerem que a capacidade de financiamento privado do ensino superior em Goias é inferior ã de outros estados. Apesar dessa limitação, menos de 30% do total de estudantes estão matriculados em cursos superiores públicos. Aqueles que conseguem acesso ao ensino superior, público ou privado, são minoria em Goiás. Segundo o [IBGE], em 2010 Goiás tinha 1.213.946 pessoas com 10 ou mais anos de idade com curso médio completo, enquanto apenas 218.548 estavam matriculadas em curso superior. Ou seja, menos de 20% continuam seus estudos até o ensino superior. Neste censo, Goiás tinha 394.491 cidadãos com curso superior completo em uma população total de 6.003.788, ou seja, 6,5% da população com curso superior. O Estado de São Paulo, por exemplo, apresenta uma taxa superior a 10%. Taxas ainda bem superiores são encontradas em outros países [OECD, 2012]. Além de contribuir para melhoria dos indicadores de educação em Goiás, o BES potencializa o crescimento da economia goiana por meio de alternativa à atual dependência do agronegócio. Essa alternativa fomenta a participação de Goiás em um mercado valioso, além de promover a criação de empregos. A posição estratégia do BES pode ser esclarecida por meio de iniciativas internacionais. Por exemplo, TechHire Initiative e Computer Scicence for All são programas americanos lançados nos dois últimos anos, orçados em cerca de 2 bilhões de dólares, com o propósito de promover a capacitação em produção de software nos Estados Unidos."
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 4,
      "chave_especial": [
        "Motivos",
        "História",
        "Criação"
      ],
      "chave_primaria": "Exposição de motivos",
      "texto": "A dependência da sociedade em relação a softwares continua se expandindo, inclusive em tarefas que antes eram exclusivas dos seres humanos, por exemplo, estacionar um veículo. Isso tem ampliado a demanda por softwares e consequentemente por profissionais que visam atender essa demanda. O conhecimento necessario para produzir software é denominado de Engenharia de Software. Tradicionalmente esse conhecimento e as habilidades necessárias são adquiridas por egressos de outros cursos de graduação ou até por meio de cursos rápidos. Nesses casos, a apropriação de habilidades ocorre de forma parcial, pois não há espaço em tais cursos para cobrir adequadamente essa extensa área. A Vocação de docentes do INF e o Programa de Reestruturação e Expansão das Universidades Federais (REUNI) resultaram na criação do primeiro curso de graduação (bacharelado) em Engenharia de Software do Brasil, o presente curso, pelo INF/UFG em 27/06/2008, conforme a resolução CONSUNI 10/2008, com o foco na formação de egressos aptos a usar de forma efetiva o conhecimento da Engenharia de Software. Essa primeira versão foi amplamente divulgada [BESl] [BES2]. Dezenas de docentes acumularam lições aprendidas desde o início da primeira turma do curso em março de 2009. A partir de outubro de 2014, o Núcleo Docente Estruturante (N DE) do curso iniciou esforço para refletir essas lições em urna nova versão do PPC. Ao longo de quase meia centena de encontros, o NDE fez uma exaustiva revisão do curso. As lições aprendidas e outras demandas, por exemplo, as diretrizes curriculares e o alinhamento com uma formação básica de qualidade em computação, definida pelo próprio INF, foram acomodadas na presente versão. Convém esclarecer que na época da criação do BES, sem similar no país, não existiam diretrizes curriculares específicas. Essas diretrizes vieram apenas em 2012 [CNE 2012].",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "string - url"
          }
        }
      ]
    },
    {
      "id": 5,
      "chave_especial": [
        "Necessidade",
        "Profissional"
      ],
      "chave_primaria": "Objetivos",
      "texto": "",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Objetivo geral",
          "texto": {
            "primeira_parte": "O BES tem como objetivo: 'Formar profissionais aptos a contribuir efetivamente com a produção de softwares de qualidade seguindo princípios éticos e postura profissional.'"
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Objetivos específicos",
          "texto": {
            "primeira_parte": "- Reconhecer e Valorizar o respeito à diversidade. Conforme se lê na Constituição Federal em seu Art. 3.°, inciso IV: “promover o bem de todos, sem preconceitos de origem, raça, sexo, cor, idade e quaisquer outras formas de discriminação”. - Promover relações étnico-raciais respeítosas, assim como a socialização da história da formação dos brasileiros. - Ampliar a compreensão acerca de questões ambientais e, ao mesmo tempo,  valorizar projetos sustentáveis. - Contribuir com a demanda da sociedade por softwares de qualidade. - Conceber e desenvolver produtos inovadores. - Promover a engenharia de software na indústria de software regional. - Viabilizar atividade econômica de alto valor (produção de software). - Criar alternativa económica para o Estado de Goiás. - Fortalecer a indústria de software goiana."
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 6,
      "chave_especial": [
        "Perfil",
        "Habilidades"
      ],
      "chave_primaria": "Expectativa da formação do profissional",
      "texto": "",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Perfil do egresso",
          "texto": {
            "primeira_parte": "O egresso do BES é um profissional com capacitação sólida em engenharia de software. Essa capacitação advém de formação básica consistente em computação e de abrangente e aprofundada em engenharia de software. O mercado de atuação do egresso é abrangente, e decorre da dependencia da sociedade por software. Adicionalmente, tal dependência tem se expandido com novos produtos, serviços e processos. A bacharela ou o bacharel em Engenharia de Software é capaz de efetivamente contribuir com equipes na produção de modelos abstratos de software e realiza-los por meio de código de qualidade. Essa contribuição é pautada por postura profissional e conduta ética. As habilidades do egresso incluem o que é necessário para lidar com requisitos de software, propor uma solução (software design), construí-la, testa-la e mantê-la, usando processos adequados."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Habilidades do egresso",
          "texto": {
            "primeira_parte": "Da perspectiva de relações pessoais, o egresso deve ser capaz de:",
            "segunda_parte": "Da perspectiva técnica, o egresso deve ser capaz de:"
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Expectativa_Formacao_Profissional/Imagem01.jpg",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Expectativa_Formacao_Profissional/Imagem02.jpg"
          }
        }
      ]
    },
    {
      "id": 7,
      "chave_especial": [
        "Princípios",
        "Base"
      ],
      "chave_primaria": "Princípios norteadores",
      "texto": "O BES baseia-se em princípios que fornecem a sustentação necessaria para atingir os objetivos do curso (p. 14) e o perfil do egresso (p. 15). Esses princípios são fornecidos abaixo.",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Formação Ética e Função Social do Profissional",
          "texto": {
            "primeira_parte": "A vivência de princípios éticos e o conhecimento sobre a responsabilidade social do Engenheiro de Software são elementos imprescindíveis para a formação da postura profissional do egresso do BES. Ética é assunto de uma das disciplinas do primeiro semestre do curso, 'Computação e Sociedade' (p. 45), e volta a ser explicitamente tratada, junto com aspectos profissionais, na última disciplina do curso 'Prática em Engenharia de Software' (p. 75). Nesse caso, a postura ética e profissional é condição a ser observada para aprovação nessa disciplina. O comportamento ético e profissional será trabalhado nas atividades do curso, e não apenas na primeira e última disciplinas. A exigência de uma conduta apropriada em sala de aula, tanto dos docentes quanto dos estudantes, contribui com essa formação. Isso significa promover a qualidade de vida, o respeito à diversidade, o respeito ao meio ambiente. Nesse sentido, não apenas as disciplinas, mas toda e qualquer ação, deve ser pautada pela reflexão do impacto no contexto no qual se insere. Ainda convém destacar que a área possui um código de ética próprio, Código de Ética e Prática Profissional da Engenharia de Software [ACM/IEEE]. Esse código é uma das bases de fundamentação do curso e deve ser observado no convívio diário do curso."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Formação Técnica",
          "texto": {
            "primeira_parte": "A formação técnica proposta para o BES está fundamentada em bases sólidas: as diretrizes curriculares nacionais [MEC 2012], o guia do corpo de conhecimento em Engenharia de Software [SWEBOK 2014], o corpo de conhecimento recomendado para ser trabalhado em um curso de graduação [SE 2014], e o modelo de competência em Engenharia de Software [SWECOM 2014]. Em consequência, o conteúdo abordado no curso não diverge das orientações nacionais nem internacionais. A organização dele, contudo, é uma 'contribuição' para a área, dado que se baseia em experiências aprendidas nos anos anteriores, juntamente com uma visão holística do aprendizado em Engenharia de Software, o que contrasta com a frequente apresentação cartesiana dessa área. As atividades do curso se aproximam do emprego da Engenharia de Software em projetos reais, no qual os conhecimentos e habilidades não são exigidos de forma fragmentada e isolada. O isolamento de conteúdo é adequado para a classificação do conhecimento que, sem o devido cuidado, pode induzir a definição de disciplinas. A estratégia de definição das disciplinas do BES é fornecida abaixo."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 3,
          "nome": "Estratégia da definição das disciplinas",
          "texto": {
            "primeira_parte": "As disciplinas do BES foram definidas com substancial cruzamento de fronteiras de subáreas do conhecimento da Engenharia de Software. A estratégia na qual se define uma disciplina por subárea foi preterida. Convém ressaltar que o corpo de conhecimento da area [SWEBOK 2014] foi extensivamente empregado, mas não como exemplo de organização didática. Em vez da separação de tópicos induzida pela classificação do conhecimento, o conteúdo (ementa) atribuído a cada disciplina do BES inclui tópicos entre os quais há sinergia. Essa orientação é compatível com a prática da Engenharia de Software e não apenas reconhece, mas também respeita os vínculos entre as suas subáreas. Isso resultou em disciplinas coerentes com a pratica da Engenharia de Software. A Figura abaixo ilustra uma disciplina X qualquer do BES, composta por conteúdo das subáreas A, B e C. Ou seja, o conteúdo de X não está contido estritamente na subárea A, nem tampouco na B ou na C. Em vez disso, reúne e explora a interdependência de conceitos dessas três subáreas. As subáreas 'requisitos' e 'projeto de software', por exemplo, são contempladas em várias disciplinas do curso e não apenas nas disciplinas nas quais são o foco principal de interesse. A disciplina que enfatiza testes, por exemplo, inclui aspectos de design de software e também de requisitos, assim como aqueles de construção de software. De forma resumida, as disciplinas não são uma projeção cartesiana das 15 subãreas de conhecimento da Engenharia de Software [SWECOM 2014]. Em vez disso, são 18 disciplinas cobrindo reiteradamente várias dessas 15 áreas, sendo que uma delas cobre todas as áreas necessárias para a execução de um projeto real de produção de software."
          },
          "imagem": {
            "primeira": "https://raw.githubusercontent.com/pedlop/integracao2017/master/docs/Imagens_PPC/Principios_Norteadores/Figura1.PNG"
          }
        },
        {
          "id": 4,
          "nome": "Articulação entre Teoria e Prática Profissional",
          "texto": {
            "primeira_parte": "O perfil do egresso, definido em outra seção desse documento, exige do egresso o envolvimento com o fazer, com o exercício do conhecimento de Engenharia de Software. Essa articulação é explicitamente estabelecida por meio da seção 'Condições mínimas' definida para cada disciplina de Engenharia de Software. Tais condições, em geral, definem o que o egresso pode fazer, em outras palavras, é capaz de realizar com o conhecimento. Ou seja, o que convencíonalmente se limita ao conteúdo, ou teoria, deverá ser exercitado, ou prática, e com um nível bem definido de proficiência. A disciplina 'Prática em Engenharia de Software'  (p. 75) é um ponto explícito do curso no qual a prática é o elemento principal, perfazendo 320 horas. O fazer, contudo, não está restrito a essa disciplina. A capacidade de realização de atividades de desenvolvimento de software é exigência em boa parte das disciplinas."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 5,
          "nome": "Interdisciplinaridade",
          "texto": {
            "primeira_parte": "Produzir software significa, necessariamente, o emprego de pelo menos dois domínios. O domínio da solução, no qual a Engenharia de Software é exercitada e o domínio do problema, que fomenta a existência do software. O domínio do problema é 'universal', pois inclui saúde, educação, segurança, governo, finanças e entretenimento, dentre muitos outros. Fazer software, portanto, por si só, exige o contato com outras áreas do conhecimento. O acesso a outras áreas pode vir das disciplinas do Núcleo Livre (NL). O BES exige para a integralização curricular pelo menos 128 horas de disciplinas do NL. Essas disciplinas são escolhidas pelo estudante dentre todas aquelas oferecidas na UFG. Para ilustrar, no primeiro semestre de 2015 houve oferta de vagas para mais de 300 disciplinas de NL. Ou seja, o conjunto de opções de outras áreas do conhecimento é rico, o que contribui com uma formação ampla do estudante. Convém destacar que tais 128 horas perfazem a quantidade mínima exigida, o estudante pode fazer uso de uma carga horária maior. O mesmo é válido para o estágio não obrigatório e para as atividades complementares. O estudante deve cumprir um mínimo de 192 horas em atividades complementares. A interdisciplinaridade estimulada pelos elementos citados acima e extra curso. Aquela intracurso é tratada tanto pela definição das disciplinas quanto pela disciplina 'Prática em Engenharia de Software'. Nesses casos a interdisciplinaridade é compulsória, pois faz parte da própria concepção do curso. Adicionalmente, sem restringir a liberdade metodológica do docente, cabe ao NDE orientar a definição de programas de disciplinas que cultivem a interdisciplinaridade."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 6,
          "nome": "Disciplina 'Prática em Engenharia de Software'",
          "texto": {
            "primeira_parte": "Essa disciplina de 320 horas tem como objetivo explicito a participação do estudante em um ou mais projetos integradores que usufruem de conhecimento e habilidades adquiridos por todo o curso. Os projetos exigem o contato com problemas reais, o que exige contato tanto com o conhecimento quanto profissionais de outras áreas."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 7,
          "nome": "Atividades supervisionadas",
          "texto": {
            "primeira_parte": "De acordo com a Resolução CNE/CES 03/2007 de 2 dejulho de 2007, cabe às Instituições de Educação Superior, respeitando o mínimo dos duzentos dias letivos de trabalho acadêmico efetivo, a definição da duração da atividade acadêmica ou do trabalho discente efetivo, o que compreende: (a) preleções e aulas expositivas e (b) atividades práticas supervisionadas, tais como laboratórios, atividades em biblioteca, iniciação científica, trabalhos individuais e em grupo, práticas de ensino e outras atividades no caso das licenciaturas. O BES divide cada hora de atividade acadêmica em 45 minutos de preleções e aulas expositivas e 15 minutos de atividades práticas supervisionadas. O planejamento de cada hora deve estar devidamente registrado no plano de cada disciplina. Em particular, o plano deve incluir de forma clara as atividades práticas supervisionadas."
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 8,
      "chave_especial": [
        "Acompanhamento",
        "NDE"
      ],
      "chave_primaria": "Núcleo Docente Estruturante (NDE)",
      "texto":"",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Princípios",
          "texto": {
            "primeira_parte": "Em vez de atribuir atividades ao NDE, o NDE adota os seguintes princípios:",
            "segunda_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/nde/Topicos_NDE_01.PNG?raw=true",
            "segunda": ""
          }
        },
        {
          "id": 2,
          "nome": "Definições",
          "texto": {
            "primeira_parte": "Esses princípios definem que todo o conteúdo do presente PPC e a aplicação dele está no raio de atuação do NDE. O que inclui:"
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/nde/Topicos_NDE_02.PNG?raw=true"
          }
        }
      ]
    },
    {
      "id": 9,
      "chave_especial": [
        "Estágio",
        "Experiência",
        "Atividades"
      ],
      "chave_primaria": "Política e gestão de estágio não obrigatório",
      "texto": "O estágio do BES constitui-se em um mecanismo de complementação de conhecimento e aperfeiçoamento de habilidades, além de oportunidade de prática em Engenharia de Software. O convívio com profissionais, obrigações, hierarquias e processos onde o estágio se desenvolve, resulta em oportunidade valiosa para a formação profissional do egresso. O estágio do BES não é de caráter obrigatório, ficando a critério do estudante realizá-lo ou não, desde que o mesmo esteja regularmente matriculado no curso. Ou seja, caracteriza estágio curricular não obrigatório. Adicionalmente, esse estágio deve ser realizado a partir do terceiro período do curso, ou após a conclusão de pelo menos 640 horas da carga horária do curso. Convém observar que o estágio está restrito às empresas  devidamente conveniadas com a UFG ou que se utilizam de agentes de integração conveniados. Adicionalmente, dois outros papéis são obrigatórios no estágio: (a) supervisor (no local do estágio) e (b) orientador (professor do curso). Durante o estagio, que não pode ultrapassar 24 meses em mesmo local, o estudante deverá apresentar o Termo de Compromisso, o Plano de Estagio, além da frequência e dos relatórios semestrais. Os documentos citados acima, bem como outros detalhes do estágio, em conformidade com a Lei 11.788/2008, são definidos pelo Regulamento de Estágio de Curso do Bacharelado em Engenharia de Software.",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 10,
      "chave_especial": [
        "TCC",
        "Conclusão"
      ],
      "chave_primaria": "Trabalho de Conclusão de Curso (TCC)",
      "texto": "O Trabalho de Conclusão de Curso (TCC) no BES é um componente curricular obrigatório regulado pelas Normas e Procedimentos de Trabalho de Conclusão de Curso do Bacharelado em Engenharia de Software. O TCC é desenvolvido na última etapa da graduação, sob a orientação de um professor e compreende um relatório e uma apresentação. O relatório é individual e tem como objetivo a expressão do estudante na forma escrita, a capacidade de analisar, caracterizar, investigar, discutir, implantar, pesquisar, realizar, sintetizar e avaliar, entre outras. Neste sentido, orelatório descreve, de forma crítica, as atividades teórico-práticas e de formação profissional relacionadas ao desenvolvimento do estudante como profissional, em especial, durante a disciplina Prática em Engenharia de Software (p. 75). A apresentação do relatório, também individual, é realizada como última atividade do curso e tem corno objetivo a expressão do estudante, agora na forma oral, das atividades descritas no relatório, em seção pública e para uma banca formada por professores do INF. A banca de professores tem o direito a um período de arguição e e responsável pela avaliação tanto do relatório quanto da apresentação.",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 11,
      "chave_especial": [
        "Complementar",
        "Extensão"
      ],
      "chave_primaria": "Integração ensino, pesquisa e extensão",
      "texto": "A integração do ensino com a pesquisa e a extensão se verifica por meio de atividades complementares, do estágio não obrigatório, de disciplinas do curso e da postura didática dos docentes, conforme comentado abaixo. As atividades complementares são identificadas em resolução própria, perfazem pelo menos 192 horas e explicitamente incluem ações de extensão e de pesquisa. Por exemplo, divulgação de trabalhos em eventos científicos, participação em projetos de extensão e participação em projetos de pesquisa, dentre outras. O estagio não obrigatório é um instrumento de integração. As atividades a serem realizadas pelo estudante podem incluir ações de pesquisa. A disciplina Metodologia e Experimentação em Engenharia de Software oferece a visão exigida para a realização de pesquisas na área. Isso significa não apenas orientar o estudante acerca da elaboração de uma revisão sistemática, mas também da necessidade da expansão do conhecimento da área e dos mecanismos atualmente empregados para tal.Um contundente exemplo é a disciplina de 320 horas, Prática em Engenharia de Software. Essa disciplina envolve em sua concepção 0 ensino, a extensão e a pesquisa ao se concentrar em projetos reais executados no ambiente de uma Fábrica de Software. Qualquer que seja o projeto, esse envolverá extensão e/ ou pesquisa, naturalmente, ainda em um cenário de aprendizado (ensino). A integração, contudo, não ocorre apenas por meio dos elementos acima, que seriam pontos de integração localizados e em períodos específicos. A integração deve ocorrer, onde oportuno, em cada ação do curso. Por exemplo, uma postura didática recomendável exige a contextualização de cada aula acerca do que será visto, da repercussão ou relação dela com a indústria de software (sociedade) e do estado da arte corrente. De fato, essa postura não apenas recomendável, mas exigida por meio das “condições mínimas” definidas para cada disciplina. Ou seja, a integração do ensino com a pesquisa e a extensão ocorre por toda a extensão do curso",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
        {
      "id": 12,
      "chave_especial": [
        "Avaliação",
        "Metodologia"
      ],
      "chave_primaria": "Avaliação do processo de ensino e aprendizagem",
      "texto": "O que é realizado em nome do curso para que o estudante adquira o perfil esperado pode ser avaliado considerando informações geradas externamente e outras internamente. A avaliação do curso pelo MEC e os resultados obtidos pelos estudantes do curso no ENADE são exemplos de insumos para a avaliação do processo de ensino. Internamente, a avaliação do docente pelo discente (instrumento formal e institucionalizado na UFG), o desempenho dos estudantes do curso nas disciplinas e os planos de ensino das disciplinas são fontes valiosas de informação. O NDE do curso e o principal consumidor dessas informações com o propósito de detectar possíveis melhorias e fomentar a introdução delas. Por exemplo, embora o docente tenha autonomia metodológica ao planejar e executar o plano de ensino de uma disciplina, cabe ao NDE analisar o plano e, quando considerar oportuno, recomendar ajustes. Essas e outras ações devem ser realizadas durante a semana de planejamento pedagógico e administrativo (semana formalmente instítucionalizada na UFG), que ocorre no início de cada período letivo. Convém destacar que o plano de ensino de cada disciplina deve ser aprovado formalmente pelo Conselho Diretor da unidade antes do início do período letivo. Adicionalmente, a ação de avaliação não deve estar restrita à semana de planejamento, mas contínua. O objetivo é viabilizar a introdução de uma eventual mudança o mais próximo possível do instante no qual a necessidade foi detectada. Outra ação relevante do NDE na semana de planejamento pedagógico e apresentar as lições aprendidas no período anterior. Oferecer visibilidade de processos de ensino exitosos, o que é um instrumento de valorização do docente e, ao mesmo tempo, forma de socializar o que produziu bons resultados, também é urna ação a ser executada nessa semana. Enfim, acerca da avaliação do processo de ensino, o NDE possui papel relevante na identificação de dificuldades e busca de alternativas, em comunhão com os  docentes do curso. A avaliação do processo de ensino, da aprendizagem e do curso, dentre outros, são assuntos pertinentes ao NDE (p. 23). De fato, são interconectados. Em vez de estabelecer ações específicas no presente PPC, são fornecidos princípios adotados pelo NDE do curso (p. 23). Ou seja, orientar os estudantes do curso a cada início do período letivo acerca das normas da UFC, de prazos, da meta de integralização curricular de cada um deles, são algumas ações relevantes, tendo em vista tais princípios. A avaliação da aprendizagem pode ser materializada de varias formas. São comuns avaliações (provas) escritas e individuais, a avaliação por meio de relatórios ou trabalhos escritos e apresentações orais, dentre outras. A avaliação contínua por meio de exercícios realizados ao longo de toda uma disciplina também e uma forma. De fato, vale ressaltar que um método adequado de avaliação em um cenário não o é em outro. A avaliação do processo de ensino e aprendizagem do BES deve atender, no seu planejamento e na forma contínua de sua execução, o estipulado pelo Regulamento Geral dos Cursos de Graduação (RGCG) da UFG [CEPEC 2012], notadamente em seu Capítulo IV, Seção l - 'Da verificação da Aprendizagem'.Cabe ressaltar que o Sistema de Avaliação do BES tem como objetivo primeiro de sua aplicação, por meio de sua Estrutura Curricular (p. 35), utilizando instrumentos pedagógicos norteados pelos Princípios Norteadores (p. 18), permitir que cada estudante adquira o perfil desejado (p. 15). A avaliação do estudante deve levar em consideração não apenas o atendimento de requisitos técnicos de produtos e processos das diversas disciplinas da Engenharia de Software, mas também demonstrar postura ética e profissional ao desenvolver ações do curso. Convém destacar que as disciplinas específicas de Engenharia de Software são acompanhadas, cada uma delas, de seção de 'Condições mínimas'(p. 56), que identificam elementos obrigatórios a serem satisfeitos pelo estudante para ser considerado aprovado na disciplina. Embora essa seja uma interpretação correta, a intenção é estabelecer um contrato claro do compromisso do estudante e do docente com a disciplina em questão. A avaliação de cada urna dessas disciplinas, portanto, necessariamente deve observar as condições mínimas estabelecidas. De fato, a condução de toda a disciplina deve serorientada por tais condições.Dada a especificidade da disciplina 'Prática em Engenharia de Software' (p.75), o sistema de avaliação também é específico. Nesse caso, as avaliações devem envolver o domínio de processos e a geração de produtos de Engenharia de Software. Em particular, atividades avaliativas podem ser realizadas mesclando teoria e prática em um ambiente real de desenvolvimento de software, no qual a qualidade estabelecida para os entregáveis do projeto em questão é verificada.",
      "chave_secundaria": [
       {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
        {
      "id": 13,
      "chave_especial": [
        "Revisão",
        "Evolução"
      ],
      "chave_primaria": "Avaliação do projeto de curso",
      "texto": "O presente PPC deverá ser revisado formalmente de cinco em cinco anos, em ação proativa, ou em intervalo de tempo menor, na ocorrência de evento que justifique tal decisão. O NDE é responsável pelas revisões do PPC e, em particular, por contínua vigilância da adequação do PPC ao cenário corrente. Esse esforço se realizada de duas formas. Uma no sentido de fazer com que as orientações do PPC sejam observadas no cotidiano do curso e outra, onde considerado oportuno, na análise de possíveis melhorias para reagir adequadamente às mudanças do ambiente. Ao acompanhar o curso, o NDE continuamente coleta, detecta e propõe alterações. As demandas podem se originar dos estudantes, dos docentes e de outras fontes como os resultados dos estudantes do curso no Exame Nacional de Desempenho de Estudantes (ENADE).",
      "chave_secundaria": [
       {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 14,
      "chave_especial": [
        "Docentes",
        "Qualificação",
        "Professores"
      ],
      "chave_primaria": "Política de qualificação",
      "texto": "Desde a criação o Instituto de Informática implementa uma política vigorosa de capacitação do seu corpo docente, a qual inclui a meta de que todos os docentes tenham a titulação minima de doutor. De fato, a liberação de docentes para prosseguirem os seus estudos de pós-graduação é uma prática comum, em consequencia, nenhum pedido para afastamento com o propósito de realizar o doutorado foi negado até o momento. Essa política é acrescentada de regras institucionalizadas para a concessão de afastamento para o pós-doutorado e de licença para capacitação. A qualificação de docentes do INF também pode ser obtida pela sua participação em congressos, simpósios, dentre outros eventos, quer seja nos papéis de autor de artigo, organizador de evento, membro de comitê de programa ou avaliador de artigo. O Instituto de Informatica ainda financia ou co-financia viagens e inscrições de seus docentes em congressos e simpósios importantes, principalmente quando há publicação de artigo. Em harmonia com a política de capacitação docente, o INF é favorável ao aprimoramento e à capacitação de seu corpo Técnico-Administrativo em Educação (TAE). Normalmente, um TAE faz solicitação ao diretor, encarregado de registrar as intenções de afastamento no plano anual de capacitação e conduzir a apreciação das intenções pelo Conselho Diretor do INF, haja vista que é do interesse da unidade fomentar a especialização e capacitação dos seus profissionais. E frequente a liberação das atividades de TAE para que possam participar de treinamentos, tanto em cursos esporádicos quanto em programas de pós-graduação. Em tempo, as ações de extensão do INF reservam vagas exclusivas para participação de TAEs, sem necessidade de pagamento (quando é o caso). Do ponto de vista legal, o INF se apoia na Resolução CEPEC 1286/2014 de 2014 [CEPEC 2014], que regulamenta o afastamento de docentes para cursar Mestrado, Doutorado e estágios Pós-Doutorais, e na Resolução CONSUNI 02/2014 [CONSUNI 2014], que regulamenta o Programa de Capacitação e o Plano Anual de Capacitação dos TAEs. Em consonância corn a Resolução CEPEC 1286/2014, o INF instrui o afastamento de docentes com a Resolução CD/INF n. O1 de 2014, que dá suporte ao planejamento administrativo e incentiva a participação de seus docentes, em cursos de doutorado, pós-doutorado e capacitação, no país e no exterior, de acordo com a sua política de pessoal para o ensino, a pesquisa, a extensão e a administração. Por fim, cabe ao NDE monitorar o PPC e, consequentemente, promover ações que promovam a qualidade dos serviços oferecidos tanto por docentes quanto por TAEs.",
      "chave_secundaria": [
        {
          "id": 0,
          "nome": "",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 15,
      "chave_especial": [
        "Normativos",
        "Informações legais",
        "Social",
        "Obrigações",
        "Inclusão",
        "Etnico-Raciais",
        "Especiais"
      ],
      "chave_primaria": "Requisitos legais e normativos",
      "texto": "O curso de Bacharelado em Engenharia de Software contempla requisitos legais específicos, a saber, Libras, Política de Educação Ambiental, e Educação das Relações Etnico-raciais e para o Ensino da História e Cultura Afro-brasileira e Indígena, conforme detalhado nas seções seguintes. A atenção a tais requisitos se verifica por meio de disciplinas e de um Programa de Extensão, devidamente institucionalizado na unidade executora do curso. Está além do escopo do presente documento detalhar o Programa de Extensão. Abaixo, apenas aspectos relevantes para o PPC são destacados.",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Libras",
          "texto": {
            "primeira_parte": "O Decreto 5.626/2005 regulamenta a Lei 10.436, de 24 de abril de 2002, e o artigo 18 da Lei 10.098, de 19 de dezembro de 2000. Segundo esse Decreto, a disciplina curricular Libras é obrigatória para vários cursos, dentre eles, as licenciaturas e os cursos de Fonoaudiologia. O Decreto também estabelece que, nos demais cursos, a disciplina curricular Libras seja Optativa, conforme o Capítulo II, § 2°: 'a Libras constituir-se-á em disciplina curricular Optativa nos demais cursos de educação superior'. Em atenção a tal requisito legal, o Bacharelado em Engenharia de Software inclui a disciplina Libras como Optativa, no oitavo período do curso."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 2,
          "nome": "Politica de Educação Ambiental",
          "texto": {
            "primeira_parte": "A Lei 9.795, de 27 de abril de 1999, institui a Política Nacional de Educação Ambiental, que é regulamentada pelo Decreto 4.281, de 25 de junho de 2002. Conforme essa Lei, Seção II, Art. 10, 'a educação ambiental será desenvolvida como uma prática educativa integrada, contínua e permanente em todos os niveis e modalidades do ensino formal'. Adicionalmente, lê-se na Seção II, Art. 10, § 1°: 'a educação ambiental não deve ser implantada como disciplina específica no currículo de ensino'. O destaque (negrito) é do presente documento. O Bacharelado em Engenharia de Software trata a Educação Ambiental por duas linhas contínuas de atuação: uma delas baseada no planejamento das disciplinas e outra em programa institucional do Instituto de Informática, ambas comentadas abaixo."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 3,
          "nome": "Planejamento das Disciplinas",
          "texto": {
            "primeira_parte": "O planejamento de cada turma deve se inspirar em possíveis estratégias de inserção de questões ambientais. Por exemplo, adoção de material em formato digital em vez de formato impresso. A apresentação do conteúdo de cada disciplina também pode se beneficiar do volume significativo de dados sobre o meio ambiente. Por exemplo, área desmatada ao longo do tempo; áreas de preservação; consumo de energia; emissão de CO2; qualidade do ar; consumo de materiais poluentes e geração de lixo eletrônico. Tais dados podem ser empregados para ilustrar o funcionamento de algoritmos e visualização de informações, dentre outras possibilidades. Convém destacar que esses exemplos devem ser vistos como elementos de inspiração, a serem renovados continuamente."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 4,
          "nome": "Programa institucional",
          "texto": {
            "primeira_parte": "A UFG executa um Plano de Logística Sustentável (PLS), que estabelece práticas de sustentabilidade e racionalização de gastos e processos na administração pública [PLS]. Esse plano e internalizado no Instituto de Informática por um Programa Institucional de extensão. O PLS une o cotidiano da prática académica com atitudes 'sustentáveis' por meio de recomendações simples, como a impressão em ambos os lados de uma folha e a redução do uso de copos descartáveis, dentre muitas outras. O Programa Institucional reúne ações que contemplam as orientações do PLS. O objetivo é colocar em prática essas orientações. Por exemplo, enquanto o PLS sugere a coleta seletiva, esse programa cria um repositório para coleta de pilhas e baterias já utilizadas, além de assegurar que aquele material coletado será descartado de forma correta. O Programa Institucional possui objetivos e ações que incluem a educação ambiental. As opções de ações variam. Dentre elas uma é constante: avaliação dos resultados. Dentre as demais:"
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Requisitos_Legais_e_Normativos/Topicos_BES_PPC.PNG?raw=true"
          }
        },
        {
          "id": 5,
          "nome": "Resolução N° 1 de 17 dejunho de 2004",
          "texto": {
            "primeira_parte": "A Resolução N° l, de 17 de junho de 2004, trata das Diretrizes Curriculares Nacionais para a Educação das Relações Étnico-Raciais e para o Ensino de História e Cultura Afro-Brasileira e Africana. O objetivo é claro: 'combater o racismo e as discriminações que atingem particularmente os negros. Nessa perspectiva, propõe a divulgação e produção de conhecimentos, a formação de atitudes, posturas e valores que eduquem cidadãos orgulhosos de seu pertencimento étnico-racial, descendentes de africanos, povos indígenas, descendentes de europeus, de asiáticos. ' Tal objetivo pressupõe a 'adoção de políticas educacionais e de estrategias pedagógicas de valorização da diversidade', conforme consta na Resolução, assim como os princípios a serem observados para atende-la: (a) consciência política e histórica da diversidade; (b) fortalecimento de identidades e de direitos e (c) ações educativas de combate ao racismo e a discriminações. O Art. 7.' da Resolução ainda destaca: 'as instituições de ensino superior, respeitada a autonomia que lhe é devida, incluirão nos conteúdos de disciplinas e atividades curriculares dos diferentes cursos que ministram, a Educação das Relações Êtnico-Raciais, bem como o tratamento de questões e temáticas que dizem respeito aos afrodescendentes. 'Tendo em vista o requisito legal estabelecido pela Resolução, duas linhas de atuação são adotadas pelo Bacharelado em Engenharia de Software: inserção de conteúdo pertinente em duas disciplinas curriculares obrigatórias e o Programa Institucional de extensão do Instituto de Informática. Ambas comentadas abaixo."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 6,
          "nome": "Disciplinas de graduação obrigatórias",
          "texto": {
            "primeira_parte": "As disciplinas 'Computador e Sociedade' (p. 45) e 'Interação Humano-Computador' (p. 51) incluem, em seus ementários, tópicos pertinentes às exigências da Resolução. Em particular, remetem para o conhecimento de questões pertinentes ao continente africano e para o conhecimento e respeito à diversidade."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 7,
          "nome": "Programa institucional",
          "texto": {
            "primeira_parte": "O Programa Institucional de extensão do Instituto de Informática será realizado por meio de ações, boa parte com ênfase na socialização de conhecimento sobre questões pertinentes à formação dos brasileiros, o que invariavelmente inclui os negros e indígenas. Esse conhecimento é indispensável para a promoção da diversidade, do respeito às diferenças e da igualdade independente das crenças, do sexo, da idade, da cor, da condição social. O Instituto de Informática, por meio desse programa de extensão, dedicado exclusivamente às relações étnico-raciais e ao meio ambiente, oferece atuação contínua sobre esses tópicos, durante toda a permanência dos seus estudantes nessa unidade, sejam de graduação ou pós-graduação. Especificamente sobre questões de cunho étnico-racial, sem a intenção de ser uma apresentação exaustiva, nem restritiva, são identiñcadas algumas ações possiveis:"
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Requisitos_Legais_e_Normativos/Topicos_BES_PPC_01.PNG?raw=true"
          }
        },
        {
          "id": 8,
          "nome": "Diretrizes nacionais para Educação em Direitos Humanos",
          "texto": {
            "primeira_parte": "A disciplina 'Computador e Sociedade' (p. 45) trata questões relevantes acerca de direitos humanos: aspectos profissionais; participação de mulheres na computação e evolução de aplicações com acessibilidade, dentre outras, nas quais os direitos humanos precisam de discussões mais aprofundadas na computação. Na disciplina 'Interação Humano-Computador' (p. 51) as características humanísticas, culturais, de direitos humanos e de aspectos políticos serão abordados em mais profundidade."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 9,
          "nome": "Proteção dos direitos da pessoa com Transtornos do Espectro Autista",
          "texto": {
            "primeira_parte": "A proteção dos direitos da pessoa com transtorno do espectro autista é fundamentada na Lei N.° 12.764 de 27 de dezembro de 2012, que institui a política nacional de proteção dos direitos da pessoa com transtorno do espectro autista, e altera o § 3.' do Art. 98 da Lei N.' 8.112, de 11 de dezembro de 1990. Esse requisito legal é atendido por meio da disciplina obrigatória 'Interação Humano-Computador', que inclui em seu ementário tópicos pertinentes ao tratamento de características humanísticas e biológicas na construção de interfaces de usuário, o que possibilita a socializar informações relevantes para que portadores do Transtorno do Espectro Autista possam ser adequadamente considerados por meio de suas necessidades especiais."
          },
          "imagem": {
            "primeira": ""
          }
        }
      ]
    },
    {
      "id": 16,
      "chave_especial": [
        "Matriz Curricular",
        "Grade Curricular",
        "Disciplinas"
      ],
      "chave_primaria": "Estrutura Curricular",
      "texto":"",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Matriz curricular",
          "texto": {
            "primeira_parte": "A matriz curricular do curso perfaz 44 disciplinas descritas nas Tabelas l, 2 e 3. A Tabela 1 apresenta a lista das 17 disciplinas de formação básica em computação. Em particular, são 4 disciplinas oferecidas pelo Instituto de Matemática e Estatística (IME) e as outras 13 oferecidas pelo INF. Todas elas são obrigatórias e pertencem ao Núcleo Comum (NC).",
            "segunda_parte": "As disciplinas da Tabela l fornecem uma sólida formação em Computação, o que inclui o recomendado para a formação em Matemática. Além dessas, outras seis de Computação são oferecidas como optativas na Tabela 3 (p. 37). As disciplinas da Tabela 2, por outro lado, são específicas da Engenharia de Software. Todas elas são obrigatórias, fazem parte do Núcleo Específico (NE)",
            "terceira_parte": "São nove as disciplinas optativas. O estudante terá que escolher três delas, conforme as opções oferecidas na Tabela 3 abaixo."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/tabela_1.PNG?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/tabela_2.PNG?raw=true",
            "terceira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/tabela_3.PNG?raw=true"
          }
        },
        {
          "id": 2,
          "nome": "Núcleo livre",
          "texto": {
            "primeira_parte": "O Núcleo Livre (NL) é o conjunto de conteúdos voltado para promover a interdisciplinaridade e a transdisciplinaridade, dentre outros objetivos. A carga horária definida pelo BES para o NL e de 128 horas, que é o mínimo estabelecido pelo Regimento Geral dos Cursos de Graduação (RGCG) da UFG [RGCG]. Tais 128 horas perfazem 4% da carga horária do curso, conforme a Tabela 4 (p. 38)."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 3,
          "nome": "Atividades complementares",
          "texto": {
            "primeira_parte": "O estudante do BES deve cumprir o mínimo de 192 horas em atividades complementares para a integralização curricular. Essas horas correspondem a 6% da carga horária do curso, conforme a distribuição da carga horária do curso na Tabela 4 (p. 38). As atividades complementares contemplam ações de monitoria, produção científica, extensão, produção técnica e de representação e qualificação, dentre outras. O cumprimento das atividades complementares é estabelecido formalmente pelo Regulamento de Atividades Complementares do Bacharelado em Engenharia de Software."
          },
          "imagem": {
            "primeira": ""
          }
        },
        {
          "id": 4,
          "nome": "Distribuição da carga horária",
          "texto": {
            "primeira_parte": "As Tabelas 1, 2 e 3, juntamente com a definição das horas do Núcleo Livre (NL) e das atividades complementares, seções acima, resultam nos valores compilados na Tabela 4."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/tabela_4.PNG?raw=true"
          }
        },
        {
          "id": 5,
          "nome": "Fluxo sugerido",
          "texto": {
            "primeira_parte": "Conforme o diagrama abaixo, as disciplinas estão organizadas em nove períodos letivos. Os quatro primeiros períodos concentram as disciplinas de formação básica em Computação: disciplinas de Computação propriamente ditas e aquelas de Matemática. Os demais períodos incluem disciplinas com ênfase na formação específica em Engenharia de Software."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/figura_estrutura.png?raw=true"
          }
        },
        {
          "id": 6,
          "nome": "Pré-requisitos",
          "texto": {
            "primeira_parte": "Existem pré-requisitos entre as disciplinas. Aqueles das disciplinas optativas são exibidos na Figura 3, enquanto aqueles das disciplinas obrigatórias na Figura 4 (p. 44-). Observe que as disciplinas optativas estão agrupadas na Figura 3 conforme as opções oferecidas aos estudantes. Por exemplo, a disciplina OPTATIVA l, sugerida para ser cursada no 3.' período, será escolhida pelo estudante dentre as seguintes opções: 'Sistemas Operacionais' (p. 53), 'Pesquisa Operacional' (p. 53) ou 'Linguagens Formais e Autômatos' (p. 53). Para a disciplina OPTATIVA 2, sugerida para ser cursada no 4.' período, as opções são: 'Redes de Computadores' (p. 54), 'Introdução à Língua Brasileira de Sinais' (p. 53) e 'Compiladores' (p. 54). Para a disciplina OPTATIVA 3, sugerida para ser cursada no 8.' período, as opções são: 'Sistemas Distribuídos' (p. 55), 'Mercado e Economia de Software' (p. 74) e 'Metodologia e Experimentação em Engenharia de Software' (p. 74). Ainda convém destacar que algumas disciplinas optativas dependem de outras obrigatórias. Por exemplo, conforme ilustrado abaixo, 'Pesquisa Operacional' tem como pré-requisito a disciplina obrigatória 'Álgebra Linear'.",
            "segunda_parte": "Todos os pré-requisitos das disciplinas obrigatórias são exibidos na Figura 4-. As disciplinas seguem alinhadas, na horizontal, do primeiro até o último (nono) período do curso. Em particular, o caminho mais longo, não é o caminho crítico, encontra-se devidamente destacado dos demais."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/figura_3.PNG?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Estrutura_Curricular/figura_4.PNG?raw=true"
          }
        }
      ]
    },
    {
      "id": 17,
      "chave_especial": [
        "Obrigatórias",
        "Programação",
        "Matemática",
        "Básica"
      ],
      "chave_primaria": "Disciplinas de formação básica (obrigatórias)",
      "texto":"",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Computação e Sociedade",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_1.PNG?raw=true"
          }
        },
        {
          "id": 2,
          "nome": "Introdução à Programação",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_2.PNG?raw=true"
          }
        },
        {
          "id": 3,
          "nome": "Cálculo 1A",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_3.PNG?raw=true"
          }
        },
        {
          "id": 4,
          "nome": "Fundamentos de Matemática para Computação",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_4.PNG?raw=true"
          }
        },
        {
          "id": 5,
          "nome": "Arquitetura de Computadores",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_5.PNG?raw=true"
          }
        },
        {
          "id": 6,
          "nome": "Algoritmos e Estruturas de Dados 1",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_6.PNG?raw=true"
          }
        },
        {
          "id": 7,
          "nome": "Probabilidade e Estatística A",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_7.PNG?raw=true"
          }
        },
        {
          "id": 8,
          "nome": "Álgebra Linear",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_8.PNG?raw=true"
          }
        },
        {
          "id": 9,
          "nome": "Lógica Matemática",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_9.PNG?raw=true"
          }
        },
        {
          "id": 10,
          "nome": "Programação Orientada a Objetos",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_10.PNG?raw=true"
          }
        },
        {
          "id": 11,
          "nome": "Algoritmos e Estruturas de Dados 2",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_11.PNG?raw=true"
          }
        },
        {
          "id": 12,
          "nome": "Linguagens e Paradigmas de Programação",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_12.PNG?raw=true"
          }
        },
        {
          "id": 13,
          "nome": "Engenharia de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_13.PNG?raw=true"
          }
        },
        {
          "id": 14,
          "nome": "Análise e Projeto de Algoritmos",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_14.PNG?raw=true"
          }
        },
        {
          "id": 15,
          "nome": "Interação Humano-Computador",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_15.PNG?raw=true"
          }
        },
        {
          "id": 16,
          "nome": "Banco de Dados",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_16.PNG?raw=true"
          }
        },
        {
          "id": 17,
          "nome": "Projeto de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_de_Forma%C3%A7%C3%A3o_B%C3%A1sica/figura_17.PNG?raw=true"
          }
        }
      ]
    },
    {
      "id": 18,
      "chave_especial": [
        "Optativas",
        "Sistemas",
        "Redes",
        "Linguagens de Programação"
      ],
      "chave_primaria": "Disciplinas optativas",
      "texto":"Além das disciplinas definidas nessa seção, duas outras são optativas e específicas de Engenharia de Software: Mercado e Economia de Software (p.74) e Metodologia e Experimentação em Engenharia de Software (p. 74).",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Sistemas Operacionais",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura1.PNG?raw=true"
          }
        },
        {
          "id": 2,
          "nome": "Pesquisa Operacional",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura2.PNG?raw=true"
          }
        },
        {
          "id": 3,
          "nome": "Linguagens Formais e Automatos",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura3.PNG?raw=true"
          }
        },
        {
          "id": 4,
          "nome": "Redes de computadores",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura4.PNG?raw=true"
          }
        },
        {
          "id": 5,
          "nome": "Introdução à Língua Brasileira de Sinais",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura5.PNG?raw=true"
          }
        },
        {
          "id": 6,
          "nome": "Compiladores",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura6.PNG?raw=true"
          }
        },
        {
          "id": 7,
          "nome": "Sistemas Distribuídos",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Optativas/figura7.PNG?raw=true"
          }
        }
      ]
    },
    {
      "id": 19,
      "chave_especial": [
        "Engenharia de Software",
        "Software",
        "Construção",
        "Processo",
        "Gerência",
        "Padrões de Projeto",
        "Teste",
        "Dispositivos Móveis",
        "Ubíquo",
        "Qualidade"
      ],
      "chave_primaria": "Disciplinas específicas de Engenharia de Software",
      "texto":"Em geral, disciplinas são apresentadas em um padrão composto por ementa, bibliografia básica e bibliografia complementar. As disciplinas de Engenharia de Software, descritas nessa seção, acrescentam uma dimensão denominada 'condições mínimas', elucidada a seguir.",
      "chave_secundaria": [
        {
          "id": 1,
          "nome": "Condições mínimas",
          "texto": {
            "primeira_parte": "ldealmente uma disciplina deve ser não ambígua e verificável. Por não ambiguá entenda que, sem interferir na autonomia metodológica do docente, o registro de cada disciplina deve ser preciso no foco e no compromisso dela perante as demais ações do curso. Por verificável entenda que o processo de avaliação dos estudantes deve ser bem definido. O esforço para descrever uma disciplina sem ambiguidades e verificável não implica em perfeição. Em vez desse alvo, o objetivo é reduzir as variações constatadas e decorrentes de quem ministra a disciplina. Essas variações resultam em flutuação da qualidade, cuja redução é, de fato, o que justifica o cuidado com a forma empregada para especificar as disciplinas. A ementa de uma disciplina define o escopo do discurso da disciplina, ou seja, o que deve ser abordado na disciplina. Para cada tópico da ementa uma carga horária é definida. Embora todos os tópicos sejam relevantes, alguns devem receber maior atenção do que outros. O objetivo é zelar pela consistência e coerência do projeto pedagógico como um todo. Noutras palavras, a simples inversão ou alteração dessas horas só faz sentido se a repercussão for considerada em todo o conjunto das disciplinas, o que resultaria em projeto pedagógico distinto. Adicionalmente, esta atribuição de carga horária por tópico não é arbitrária, mas definida de forma criteriosa para atender o perfil definido para o egresso do curso. As condições mínimas definem o quanto o escopo, definido pela ementa, deve ser do domínio do estudante para aprovação na disciplina em questão. Ou seja, enquanto a ementa define o objeto, as condições mínimas definem o mínimo que se espera do estudante em relação a tal objeto para que ele seja aprovado na disciplina. Essas condições são identificadas por um conjunto de atividades, onde cada atividade e acompanhada de um nível. Ou seja, as atividades definem o que o estudante deve estar apto a fazer, a realizar, acerca do objeto em questão, e o nível define a proficiência esperada ao realizar a atividade em questão. São tres os níveis:",
            "segunda_parte": "As condições mínimas não se confundem com as condições 'desejadas', ou 'ideais' de uma disciplina. De fato, espera-se que o egresso de cada disciplina esteja apto a realizar atividades além daquelas registradas nas condições mínimas e em níveis mais exigentes do que os estabelecidos. Contudo, ao realizar todas as atividades, nos níveis identificados pelas condições mínimas, o estudante é considerado aprovado na disciplina em questão."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/CondicoesMinimas.jpg?raw=true"
          }
        },
        {
          "id": 2,
          "nome": "Construção de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina01-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina01-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 3,
          "nome": "Modelagem de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina02-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina02-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 4,
          "nome": "Processos de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina03-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina03-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 5,
          "nome": "Engenharia de Sistemas",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina04-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina04-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 6,
          "nome": "Design de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina05-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina05-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 7,
          "nome": "Domínios de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina06-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina06-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 8,
          "nome": "Processos de Qualidade de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina07-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina07-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 9,
          "nome": "Gerência de Projeto de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina08-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina08-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 10,
          "nome": "Software Concorrente e Distribuído",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina09-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina09-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 11,
          "nome": "Experiência do Usuário de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina10-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina10-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 12,
          "nome": "Arquitetura de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina11-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina11-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 13,
          "nome": "Requisitos de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina12-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina12-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 14,
          "nome": "Governança e Gestão de Serviços de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina13-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina13-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 15,
          "nome": "Software para Sistemas Ubíquos",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina14-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina14-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 16,
          "nome": "Software para Persistência de Dados",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina15-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina15-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 17,
          "nome": "Padrões de Arquitetura de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina16-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina16-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 18,
          "nome": "Teste de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina17-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina17-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 19,
          "nome": "Metodologia e Experimentação em Engenharia de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina18-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina18-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 20,
          "nome": "Mercado e Economia de Software",
          "texto": {
            "primeira_parte": ""
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina19-ementa.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina19-condicoes.jpg?raw=true"
          }
        },
        {
          "id": 21,
          "nome": "Prática em Engenharia de Software",
          "texto": {
            "primeira_parte": "",
            "segunda_parte": "O egresso do BES passa pela vivência de dois tipos de experiências práticas diferentes em suas essências. O primeiro grupo de experiências é composto pelas experiências promovidas nas atividades práticas realizadas de maneira contínua e integrada desde o início do curso, no contexto das diversas disciplinas teórico-práticas que compõem a grade curricular do BES. O segundo tipo de experiências é proporcionado pela disciplina 'Prática em Engenharia de Software', que envolve a participação integral do aluno em projetos reais de Engenharia de Software realizados em ambiente típico da indústria de software. E importante contrapor esse cenário de “projeto real', onde todas as competências são exigidas, com o cenário das atividades práticas realizadas dentro do contexto de uma disciplina, normalmente limitado pelo conteúdo da própria disciplina. A Engenharia de Software compreende o uso de processos. Tais processos são claramente explicitados no projeto pedagógico do curso e podem ser classificados em dois grandes tipos: Processos Técnicos de Engenharia de Software e Processos de Gestão de Engenharia de Software. Alem disso, o domínio de Tecnologias de Engenharia de Software, aplicadas tanto a processos técnicos quanto a processos de gestão de Engenharia de Software, é uma competência obrigatória para o profissional que trabalha corn software. Assim, pode-se considerar que o Engenheiro de Software deve ser capaz de realizar atividades que envolvem três tipos de competências: técnicas, gerenciais e tecnológicas. A disciplina 'Prática em Engenharia de Software' fornece o ambiente necessário para o amadurecimento das competências dos estudantes, pela aquisição de conhecimentos e desenvolvimento de habilidades e atitudes como profissional de Engenharia de Software. Esta prática acontece na fase final do currículo, na qual são reforçadas as habilidades, competências e conhecimentos adquiridos ao longo das disciplinas teórico-práticas do curso, em um ambiente que representa de forma realista os cenários que serão experimentados na vida profissional do Engenheiro de Software. O INF possui uma Fábrica de Software (FS/INF) [CUSUMANO]. O termo 'Fábrica' indica um comprometimento de longo prazo e de esforços integrados, acima do nível de projetos individuais, para aprimorar todas as operações de obtenção de software [AAEN]. NA F S/INF, os projetos têm como objetivo atender as necessidades de usuários e patrocinadores reais, ou seja, visam a geração de produtos e/ou a prestação de serviços em Engenharia de Software para a sociedade. Dessa forma, os projetos precisam atender, por exemplo, requisitos de qualidade, de escopo e restrições de custo e prazo definidos pelas partes interessadas do projeto em questão. Além disso, a FS/INF também é responsável por garantir os requisitos definidos pelas normas tecnicas aplicáveis de Engenharia de Software. Todas as atividades da Prática em Engenharia de Software previstas no BES são realizadas na FS/INF, sob a supervisão direta de docentes do Instituto de Informatica. Portanto, a cada semestre letivo, a FS/INF recebe docentes e estudantes que atuarão nos seus projetos. Cabe ressaltar que, embora os projetos e as atividades da FS/INF não estejam limitados pelo calendário acadêmico, existe um compromisso entre a FS/INF e o curso de BES assegurando que o processo de Gestão do Portfólio da Fábrica selecionará os projetos e as atividades que apresentem condições adequadas ao exercício das práticas de Engenharia de Software pelos estudantes como descritas nesse PPC. Desta forma, o estudante terá a oportunidade concreta de integrar teoria e prática, envolvendo-se em situações-problema geradas pela experiência de campo e que exigem atividades de pesquisa, consultorias, debates e adoção de novas condutas. E também uma oportunidade para que o estudante seja avaliado quanto à sua atitude ética e profissional, quanto ao respeito às normas institucionais da FS/INF e quanto à sua relação com os demais envolvidos no projeto, incluindo usuarios e patrocinadores. A 'Prática em Engenharia de Software' é realizada pelo estudante preferencialmente após ter obtido aprovação nas demais disciplinas do BES. A disciplina é integralizada com 320 horas de atividades relacionadas a projetos da FS/INF, é ofertada a cada semestre letivo e os docentes atuam como preceptores. Neste sentido, o docente é o profissional responsável pela integração teoria-prática ao longo do projeto, ensinando, supervisionando, orientando e conduzindo o aluno na pratica efetiva de sua futura profissão. Os estudantes são divididos em três grupos para melhor acompanhamento das atividades. Cada grupo, em um dado instante, realiza um tipo de atividade típica do exercício profissional: processos técnicos, processos de gestão ou domínio de tecnologias. Ao final da disciplina, é garantido que todos os grupos vivenciaram atividades dos três tipos. A avaliação do estudante é formativa, enfatizando o seu acompanhamento durante todo o periodo letivo, com o intuito de não apenas Verificar se o estudante está alcançando os objetivos propostos, mas também informando seus erros e acertos, além de promover o estímulo necessário para continuar os estudos e o seu desenvolvimento. Concluindo, a disciplina 'Prática em Engenharia de Software' favorece um ensino baseado na prática, com foco centrado na ética e na postura do profissional de Engenharia de Software perante os desafios que ocorrem quando se trabalha com software, que é um dos artefatos mais complexos que a humanidade produz. Quando o estudante atua em atividades práticas relevantes para a sua futura vida profissional, enfrentando os desafios reais de sua profissão ainda durante sua formação, sua compreensão se torna cada vez mais crítica e comprometida com a sociedade na qual se insere. Portanto, essa disciplina estimula e valoriza as dimensões ética e humanística na formação do Engenheiro de Software, desenvolvendo atitudes e valores orientados para a cidadania e para o desenvolvimento da sociedade."
          },
          "imagem": {
            "primeira": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina20-titulo.jpg?raw=true",
            "segunda": "https://github.com/pedlop/integracao2017/blob/master/docs/Imagens_PPC/Disciplinas_Especificas/Disciplina20-ementaecondicoes.jpg?raw=true"
          }
        }
      ]
    }
  ]
}
